[
    {
      "image": "https://i.postimg.cc/4NxsMq6J/meritt-thomas-Yx-DGc-Dm4-Hs-unsplash.jpg",
      "estate_title": "Luxury Beachfront Villa",
      "id": 1,
      "segment_name": "Luxury",
      "description": "The Luxury Beachfront Villa presents an unparalleled opportunity to experience coastal living at its finest. Situated along the pristine shores of Malibu California this exquisite estate offers a harmonious blend of contemporary luxury and coastal charm. As you step onto the sprawling grounds of this beachfront oasis, you are greeted by breathtaking panoramic views of the Pacific Ocean, stretching as far as the eye can see.This meticulously designed villa boasts an array of sophisticated amenities, including a private infinity pool overlooking the ocean, perfect for relaxation and entertaining guests. The expansive outdoor living spaces feature lush tropical landscaping creating a serene atmosphere ideal for alfresco dining or enjoying sunset cocktails Inside the villa exudes elegance and sophistication with spacious living areas bathed in natural light and adorned with designer finishes. The gourmet kitchen is a chef's dream equipped with state-of-the-art appliances and ample counter space for culinary creations. The luxurious master suite offers a private sanctuary with sweeping ocean views a spa-like ensuite bathroom and a walk-in closet.Whether youre lounging by the pool strolling along the sandy beach or enjoying water sports in the crystal-clear waters the Luxury Beachfront Villa offers the ultimate retreat for those seeking luxury coastal living.",
      "price": 5000000,
      "status": "Sale",
      "area": "6000 sq ft",
      "location": "Malibu, California",
      "latLng" : [34.0259, -118.7798] , 
      "facilities": ["Infinity pool", "Private beach access", "Home theater"],
      "agent" : [
        {
          "agent_name": "Emily Johnson",
          "image": "https://i.postimg.cc/6QTB4dNv/staff1-pgnhj7pzods38uvraxbywe4xh8122i8bmpkmugccpw.jpg",
          "description": "Emily Johnson is a dynamic and results-driven real estate agent with a passion for helping her clients achieve their goals. With a keen eye for market trends and a commitment to exceptional service, Emily goes above and beyond to deliver outstanding results and exceed expectations."
        }
      ]    
    },
    {
      "image": "https://i.postimg.cc/761q8ytL/pexels-expect-best-323780.jpg",
      "estate_title": "Luxury Penthouse ",
      "id": 2,
      "segment_name": "Luxury",
      "description": "Perched high above the bustling streets of Manhattan the Luxury Penthouse with City Views offers a rare opportunity to experience urban living at its most opulent. This modern masterpiece boasts panoramic vistas of the iconic city skyline, providing an unparalleled backdrop for cosmopolitan living Step into the sleek and sophisticated interiors of this penthouse retreat where floor-to-ceiling windows flood the space with natural light and frame the breathtaking views of the city below. The open-concept living area is perfect for entertaining with seamless transitions between the gourmet kitchen spacious dining area and inviting living room The expansive rooftop terrace is a true urban oasis offering an outdoor sanctuary with panoramic views lush greenery and stylish seating areas. Whether you're hosting a soirée under the stars or enjoying a quiet moment of reflection the rooftop terrace provides the perfect escape from the hustle and bustle of city life.With luxurious amenities impeccable design and unparalleled views the Luxury Penthouse with City Views epitomizes modern urban luxury in the heart of Manhattan.",
      "price": 3000000,
      "status": "Sale",
      "area": "4000 sq ft",
      "location": "Manhattan, New York",
      "facilities": ["Rooftop terrace", "Private elevator", "Gourmet kitchen"],
      "latLng" : [40.7831,-73.9712],
      "agent" : [
        {
          "agent_name": "John Smith",
          "image": "https://i.postimg.cc/rsLfMkCw/staff2-pgnhuc58jt08mqq4cqf1el3ajd7f5kdz5rhhabun38.jpg",
          "description": "With over a decade of experience in the real estate industry, John Smith is a trusted and knowledgeable agent known for his dedication to his clients. Whether you're buying, selling, or investing, John's expertise and personalized approach ensure a seamless and successful transaction every time."
        }
      ]    
    },
    {
      "image": "https://i.postimg.cc/y86gLLd9/pexels-ruby-ruby-14559842.jpg",
      "estate_title": "Luxury Waterfront Mansion",
      "id": 3,
      "segment_name": "Luxury",
      "description": "Nestled amidst the majestic peaks of Aspen, Colorado, the Luxury Mountain Retreat offers a secluded haven of tranquility and luxury. Surrounded by pristine natural beauty, this exclusive estate is a sanctuary for those seeking solace in the splendor of the Rocky Mountains.From the moment you arrive, you are enveloped in the serenity of this mountain paradise. The estate's expansive grounds feature lush landscaped gardens, tranquil ponds, and meandering pathways, inviting you to explore and reconnect with nature.Inside, the residence exudes warmth and elegance, with rustic-chic décor, exposed wooden beams, and stone accents that echo the natural beauty of the surrounding landscape. The spacious living areas are perfect for gathering with family and friends, with cozy fireplaces and floor-to-ceiling windows that frame breathtaking views of the mountains beyond.The outdoor living spaces are equally impressive, with expansive decks, a private hot tub, and a fire pit where you can unwind under the stars after a day of adventure on the slopes.Whether you're hitting the ski trails in the winter or hiking through wildflower meadows in the summer, the Luxury Mountain Retreat offers the perfect blend of luxury and adventure in one of Colorado's most coveted destinations.",
      "price": 10000000,
      "status": "Rent",
      "area": "10000 sq ft",
      "location": "Palm Beach, Florida",
      "facilities": ["Private dock", "Infinity pool", "Home gym"],
      "latLng" : [26.7056, -80.0364],
      "agent" : [
        {
          "agent_name": "Michael Williams",
          "image": "https://i.postimg.cc/Ss49KN53/staff3-pgnhuiq3vn98w0gkab9fe1fip2azng43io1vn9kvvo.jpg",
          "description": "Michael Williams is a seasoned real estate professional with a proven track record of success. Known for his integrity, professionalism, and attention to detail, Michael is dedicated to providing his clients with the highest level of service and expertise to help them achieve their real estate goals."
        }
      ]    
    },
    {
      "image": "https://i.postimg.cc/5tM59BN2/pexels-chris-g-2294125.jpg",
      "estate_title": "Exclusive Island Resort",
      "id": 4,
      "segment_name": "Resort",
      "description": "Situated on the exclusive shores of Palm Beach, Florida, the Luxury Waterfront Mansion epitomizes coastal living at its finest. With its stately façade, manicured gardens, and sweeping views of the azure waters of the Atlantic Ocean, this grand estate is a testament to luxury and elegance.Step through the imposing double doors into the grand foyer, where soaring ceilings, marble floors, and intricate architectural details set the tone for the opulence that awaits within. The mansion's expansive living spaces are designed for both grand entertaining and intimate gatherings, with multiple formal and informal dining areas, a gourmet kitchen, and a palatial living room that opens onto a sprawling terrace overlooking the ocean.The estate's outdoor amenities are equally impressive, with lush tropical landscaping, a private dock, and an infinity pool that seems to merge seamlessly with the horizon. Whether you're lounging poolside, soaking up the sun on the sandy beach, or enjoying water sports in the warm waters of the Atlantic, the Luxury Waterfront Mansion offers the ultimate retreat for those seeking the epitome of coastal luxury.",
      "price": 20000000,
      "status": "Sale",
      "area": "Entire Island",
      "location": "Maldives",
      "facilities": ["Private villas", "Spa", "Water sports"],
      "latLng" : [3.2028,-73.2207],
      "agent" : [{
        "agent_name": "Jessica Martinez",
        "image": "https://i.postimg.cc/2SFrDkQV/staff6-pgnhv83r067zlhfp648crd0yqgtwf9wum5nzlqj97o.jpg",
        "description": "Jessica Martinez brings a fresh perspective and unmatched enthusiasm to the real estate industry. With a background in marketing and customer service, Jessica leverages her skills to deliver innovative solutions and exceptional results for her clients."
    }
  ]

    },
    {
      "image": "      https://i.postimg.cc/YCQgPvfK/pexels-asad-photo-maldives-1450363.jpg",
      "estate_title": "Luxury Ski Resort",
      "id": 5,
      "segment_name": "Resort",
      "description": "Nestled amidst the snow-capped peaks of the Swiss Alps, the Luxury Ski Resort offers an unparalleled alpine retreat for discerning travelers seeking the ultimate winter getaway. Surrounded by pristine mountain scenery and world-class ski slopes, this exclusive resort exudes warmth, elegance, and sophistication at every turn.As you arrive at the resort, you are greeted by a picturesque winter wonderland, with snow-covered chalets, towering pine trees, and the crisp mountain air filling your lungs. The main lodge welcomes you with its rustic charm and cozy ambiance, featuring a roaring fireplace, plush seating areas, and panoramic views of the surrounding mountains.Accommodations at the Luxury Ski Resort are nothing short of extraordinary, with luxurious chalets and suites designed to provide the utmost comfort and relaxation after a day on the slopes. Each room is beautifully appointed with plush furnishings, sumptuous bedding, and modern amenities, ensuring a restful night's sleep and rejuvenating stay.For skiing enthusiasts, the resort offers direct access to some of the finest slopes in the Swiss Alps, with endless opportunities for skiing, snowboarding, and winter sports. Whether you're a seasoned expert or a novice skier, the resort's expert instructors and state-of-the-art facilities ensure an unforgettable experience on the slopes.After a day of adventure on the mountainside, guests can unwind and indulge in the resort's world-class amenities and services. Relax and rejuvenate tired muscles at the luxurious spa, complete with sauna, steam room, and heated indoor pool. Or, savor the flavors of the Alps at the resort's gourmet restaurants, where expert chefs craft exquisite culinary creations inspired by the region's rich culinary heritage.In the evenings, the resort comes alive with a vibrant après-ski scene, where guests can gather around crackling fires, sip on fine wines and cocktails, and share stories of the day's adventures with fellow travelers. Whether you're seeking relaxation, adventure, or simply a moment of serenity amidst the majestic beauty of the Swiss Alps, the Luxury Ski Resort promises an unforgettable winter escape.",
      "price": 15000000,
      "status": "Sale",
      "area": "100 acres",
      "location": "Swiss Alps",
      "facilities": ["Ski slopes", "Luxury chalets", "Fine dining"],
      "latLng" : [46.6056,-8.6376],
      "agent" : [{
        "agent_name": "Sarah Adams",
        "image": "https://i.postimg.cc/L5n89cHG/staff5-pgnhv1ivobyzc7p98jdyrwoqkrqbxe6q993l8st0f8.jpg",
        "description": "Sarah Adams is a highly skilled and experienced real estate professional with a passion for helping her clients find their dream homes. With a keen understanding of the local market and a commitment to excellence, Sarah provides exceptional service and support from start to finish."
    }
  ]
    },
    {
      "image": "https://i.postimg.cc/Qxt0vJHL/pexels-asad-photo-maldives-9482124.jpg",
      "estate_title": "Private Island Paradise",
      "id": 6,
      "segment_name": "Private Island",
      "description": "Tucked away in the crystal-clear waters of the Caribbean, the Private Island Paradise beckons travelers to escape the ordinary and experience the ultimate in luxury and seclusion. This exclusive island retreat offers a private sanctuary where guests can unwind, recharge, and reconnect with nature in unparalleled comfort and style.As you approach the island by boat or seaplane, you are greeted by pristine white sandy beaches, swaying palm trees, and the gentle lapping of waves against the shore. The island's lush tropical landscape provides a tranquil backdrop for relaxation and exploration with hidden coves, coral reefs and azure waters waiting to be discovered Accommodations on the Private Island Paradise are nothing short of extraordinary with luxurious villas bungalows nestled amidst the island's natural beauty. Each villa is elegantly appointed with modern amenities and stylish décor offering breathtaking views of the ocean and direct access to the beach.For those seeking adventure the island offers a wealth of outdoor activities and experiences to suit every taste and preference. Snorkel among vibrant coral reefs paddleboard along the coast or embark on a sunset cruise to watch the sky ignite in a blaze of color.In the evenings guests can indulge in gourmet dining experiences under the stars with private beachfront dinners candlelit picnics and bonfire barbecues showcasing the flavors of the Caribbean. After dinner unwind with cocktails at the island's chic beachfront bar where live music and entertainment set the stage for unforgettable evenings spent in paradise.Whether you're seeking romance relaxation or adventure the Private Island Paradise offers the perfect setting for a truly unforgettable tropical escape. From its pristine beaches and luxurious accommodations to its world-class amenities and personalized service this exclusive island retreat promises an experience unlike any other.",
      "price": 30000000,
      "status": "Rent",
      "area": "Entire Island",
      "location": "Caribbean",
      "facilities": ["Luxury villas", "Infinity pool", "Private beach"],
      "latLng" : [12.1165,-68.9304],
      "agent" : [{
        "agent_name": "David Thompson",
        "image": "https://i.postimg.cc/3w18g8NP/staff4-pgnhuvvujbr9ejxg5gy7cy3z0gi4n7kc8h6od51dgk.jpg",
        "description": "David Thompson is a dedicated and knowledgeable real estate agent committed to helping his clients achieve their real estate goals. With a focus on communication, honesty, and integrity, David provides personalized service and expert guidance throughout the buying or selling process."
    }
  ]
    }
  ]
  